<?php

use yii\db\Migration;

class m250830_082809_insert_books extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%author}}', ['id','lastname', 'firstname', 'middlename'], [
            ['1', 'Иванов', 'Иван', 'Иванович'],
            ['2', 'Петров', 'Петр', 'Петрович'],
            ['3', 'Сидоров', 'Алексей', 'Сидорович'],
            ['4', 'Иванова', 'Марфа', 'Прокопьевна'],
            ['5', 'Конева', 'Анастасия', 'Петровна'],
        ]);

        $this->batchInsert('{{%book}}', ['id','name', 'year', 'isbn', 'description', 'main_image'], [
            ['1', 'Книга 1', '2001', '978-5-7320-1162-1', 'описание 1', '9a49273b-463b-4a49-8805-f90083f7d373'],
            ['2', 'Книга 2', '2002', '978-5-7320-1162-2', 'описание 2', '9c8271ec-217f-4520-a7d7-c36899f082af'],
            ['3', 'Книга 3', '2003', '978-5-7320-1162-3', 'описание 3', 'd531f258-c01d-4af8-b312-6ed0a167a87a'],
            ['4', 'Книга 4', '2004', '978-5-7320-1162-4', 'описание 4', 'be5ba4ce-3ffd-4a52-895a-8e5812e983e0'],
            ['5', 'Книга 5', '2005', '978-5-7320-1162-5', 'описание 5', 'f3626941-3b99-4e96-a301-301d040a95ad'],
            ['6', 'Книга 6', '2001', '978-5-7320-1162-6', 'описание 6', 'f3626941-3b99-4e96-a301-301d040a95a1'],
            ['7', 'Книга 7', '2002', '978-5-7320-1162-7', 'описание 7', 'f3626941-3b99-4e96-a301-301d040a95a2'],
            ['8', 'Книга 8', '2003', '978-5-7320-1162-8', 'описание 8', 'f3626941-3b99-4e96-a301-301d040a95a3'],
            ['9', 'Книга 9', '2002', '978-5-7320-1162-9', 'описание 9', 'f3626941-3b99-4e96-a301-301d040a95a9'],
            ['10', 'Книга 10', '2001', '978-5-7320-1162-0', 'описание 10', 'f3626941-3b99-4e96-a301-301d040a95a0'],
        ]);

        $this->batchInsert('{{%book_author}}', ['id_book','id_author'], [
            ['1', '1'],
            ['1', '2'],
            ['2', '2'],
            ['2', '3'],
            ['2', '5'],
            ['3', '1'],
            ['3', '4'],
            ['4', '1'],
            ['5', '3'],
            ['5', '4'],
            ['6', '1'],
            ['7', '1'],
            ['8', '1'],
            ['9', '2'],
            ['6', '2'],
            ['7', '3'],
            ['9', '3'],
            ['10', '2'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m250829_082809_insert_books cannot be reverted.\n";

        return false;
    }
}
